Dalam chapter sebelumnya kita sudah mempelajari mengenai perbedaan antara pandas dengan series. Pada chapter kali ini kita akan mendalami penggunaan pandas dalam memanipulasi sebuah dataset, dengan menggunakan dataset publik.

In [52]:
#import packages
import pandas as pd

In [53]:
# read dataset 
df = pd.read_csv("/Users/jojomac/introduction_python/dataset/sales data-set.csv")

In [54]:
#1. head
#head digunakan untuk mengambil 5 data teratas dari dataset kita 
df.head()

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  05/02/2010      24924.50      False
1      1     1  12/02/2010      46039.49       True
2      1     1  19/02/2010      41595.55      False
3      1     1  26/02/2010      19403.54      False
4      1     1  05/03/2010      21827.90      False

In [55]:
df.head(10)

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  05/02/2010      24924.50      False
1      1     1  12/02/2010      46039.49       True
2      1     1  19/02/2010      41595.55      False
3      1     1  26/02/2010      19403.54      False
4      1     1  05/03/2010      21827.90      False
5      1     1  12/03/2010      21043.39      False
6      1     1  19/03/2010      22136.64      False
7      1     1  26/03/2010      26229.21      False
8      1     1  02/04/2010      57258.43      False
9      1     1  09/04/2010      42960.91      False

In [56]:
#tail digunakan untuk mengambil 5 data terbawah 
df.tail()

        Store  Dept        Date  Weekly_Sales  IsHoliday
421565     45    98  28/09/2012        508.37      False
421566     45    98  05/10/2012        628.10      False
421567     45    98  12/10/2012       1061.02      False
421568     45    98  19/10/2012        760.01      False
421569     45    98  26/10/2012       1076.80      False

In [57]:
df.tail(5)

        Store  Dept        Date  Weekly_Sales  IsHoliday
421565     45    98  28/09/2012        508.37      False
421566     45    98  05/10/2012        628.10      False
421567     45    98  12/10/2012       1061.02      False
421568     45    98  19/10/2012        760.01      False
421569     45    98  26/10/2012       1076.80      False

In [58]:
#2.shape
#shape digunakan untuk menampilkan dimensi pada data 
df.shape

(421570, 5)

In [59]:
#3. info 
#info digunakan untuk mengecek informasi terkait data
df.info

<bound method DataFrame.info of         Store  Dept        Date  Weekly_Sales  IsHoliday
0           1     1  05/02/2010      24924.50      False
1           1     1  12/02/2010      46039.49       True
2           1     1  19/02/2010      41595.55      False
3           1     1  26/02/2010      19403.54      False
4           1     1  05/03/2010      21827.90      False
...       ...   ...         ...           ...        ...
421565     45    98  28/09/2012        508.37      False
421566     45    98  05/10/2012        628.10      False
421567     45    98  12/10/2012       1061.02      False
421568     45    98  19/10/2012        760.01      False
421569     45    98  26/10/2012       1076.80      False

[421570 rows x 5 columns]>

In [60]:
#4. column
# untuk menampilkan list kolom kolom apa saja yang kita miliki
df.columns

Index(['Store', 'Dept', 'Date', 'Weekly_Sales', 'IsHoliday'], dtype='object')

In [61]:
column = df.columns

In [62]:
column

Index(['Store', 'Dept', 'Date', 'Weekly_Sales', 'IsHoliday'], dtype='object')

In [63]:
for i in column:
    print(i, " : ", type(i))

Store  :  <class 'str'>
Dept  :  <class 'str'>
Date  :  <class 'str'>
Weekly_Sales  :  <class 'str'>
IsHoliday  :  <class 'str'>

Dari keterangan tipe data diatas bahwa semua tipa data adalah string. Oleh sebab itu kita perlu mengganti tipe data dari Date

In [65]:
# 5. to datetime 
# mengganti tipe data ke datetime 
df['Date'] = pd.to_datetime(df['Date'], format='%d/%m/%Y')

In [66]:
# filtering 
start_date = pd.to_datetime('01/09/2012')

filtered_df = df.loc[df['Date'] >= start_date]

In [67]:
filtered_df

        Store  Dept       Date  Weekly_Sales  IsHoliday
101         1     1 2012-01-13      16894.40      False
102         1     1 2012-01-20      18365.10      False
103         1     1 2012-01-27      18378.16      False
104         1     1 2012-02-03      23510.49      False
105         1     1 2012-02-10      36988.49       True
...       ...   ...        ...           ...        ...
421565     45    98 2012-09-28        508.37      False
421566     45    98 2012-10-05        628.10      False
421567     45    98 2012-10-12       1061.02      False
421568     45    98 2012-10-19        760.01      False
421569     45    98 2012-10-26       1076.80      False

[124465 rows x 5 columns]

## Groupby

Groupby merupakan salah satu keyword yang akan sering kita gunakan, karena dapat berfungsi untuk mengelompokkan data sesuai kebutuhan kita

In [73]:
df.groupby(['Date','Weekly_Sales']).sum()

                         Store  Dept  IsHoliday
Date       Weekly_Sales
2010-02-05 -59.00            6    47          0
           -34.00           26    54          0
           -15.00            9    49          0
           -12.99           30    32          0
           -12.00           31    78          0
...                        ...   ...        ...
2012-10-26  160785.98       20    92          0
            164464.02       14    92          0
            164891.82        4    92          0
            169784.13        2    92          0
            183483.92       13    92          0

[416506 rows x 3 columns]

## Rename
Rename berguna untuk mengubah nama kolom yang kita miliki

In [75]:
df.rename(columns={
    'Store':'Toko',
    'Dept' : 'Departemen', 
    'Date':'Tahun' 
    
})

        Toko  Departemen      Tahun  Weekly_Sales  IsHoliday
0          1           1 2010-02-05      24924.50      False
1          1           1 2010-02-12      46039.49       True
2          1           1 2010-02-19      41595.55      False
3          1           1 2010-02-26      19403.54      False
4          1           1 2010-03-05      21827.90      False
...      ...         ...        ...           ...        ...
421565    45          98 2012-09-28        508.37      False
421566    45          98 2012-10-05        628.10      False
421567    45          98 2012-10-12       1061.02      False
421568    45          98 2012-10-19        760.01      False
421569    45          98 2012-10-26       1076.80      False

[421570 rows x 5 columns]

Kolom berhasil diganti